{
  "HERO_CONTENT": "I'm Luis Santos, a dedicated Java FullStack Developer with extensive experience in the development of sophisticated and scalable web applications. Over the course of more than six years in the industry, I have refined my expertise in both front-end and back-end technologies, including Angular 2+, Vue.js, React for the client side, and Java 8+, Spring Framework for server-side operations, complemented by proficiency in database management with MySQL, PostgreSQL.",

  "ABOUT_TEXT": "I am a committed Java FullStack Developer with over six years of experience in the development of scalable web applications. My technical expertise includes working with front-end frameworks like Angular, Vue.js, and React, alongside back-end development with Java and the Spring Framework. I am proficient in database management using MySQL and PostgreSQL. My professional journey includes significant contributions at Edgelab and Affinity, where I've focused on enhancing application functionality and user experience through strategic technology implementation.",

  "EXPERIENCES": [
    {
      "year": "June 2022 - April 2024",
      "role": "Software Engineer",
      "company": "Edgelab - Lausanne",
      "description": "Developed new features for three different web applications. Engaged in code migration, enhancement of existing business logic, and client support. Involved in all phases of development from design through deployment and maintenance.",
      "technologies": [
        "Java 17",
        "Spring Framework",
        "Angular 2+",
        "JUnit",
        "PostgreSQL",
        "R2DBC",
        "Kotlin/Ktor",
        "Jenkins",
        "Docker",
        "Mockito",
        "Grafana",
        "OpenAPI"
      ]
    },
    {
      "year": "July 2019 - May 2022",
      "role": "Full Stack Java Developer",
      "company": "Affinity - Lisbon",
      "description": "Worked on a web application for BNP Paribas using ExtJS, Vue.js, Java 8, Spring, and Sybase. The application facilitated internal trading activities like lending and borrowing stocks, bonds, etc. My responsibilities included developing new features, bug fixing for upcoming deployments, user support, and migrating the frontend from ExtJS to Vue.js.",
      "technologies": [
        "ExtJS",
        "Vue.js",
        "Java 8",
        "Spring",
        "Sybase",
        "Jenkins"
      ]
    },
    {
      "year": "February 2018 - July 2019",
      "role": "IT Consultant",
      "company": "Syone - Lisbon",
      "description": "Participated in a two-month Java Academy training covering various programming languages like Java, Angular, HTML, CSS, JavaScript, TypeScript. Worked full-stack on two projects, developing web applications with Angular 5, Java 8, Spring, and MySQL using an Agile/Scrum methodology and MVC architecture. Following these, I worked on a migration project, rewriting a backend from PowerBuilder to .NET.",
      "technologies": [
        "Java",
        "Angular 5",
        "HTML",
        "CSS",
        "Javascript",
        "Typescript",
        "Spring",
        "MySQL",
        ".NET"
      ]
    }
  ],

  "CONTACT": {
    "address": "1800 - Vevey",
    "phoneNo": "+41 079 693 36 41",
    "email": "lmc.santos89@gmail.com"
  }
}
